<?php

namespace App\Http\Controllers;

use Illuminate\Http\Request;

class StockController extends Controller
{
    public function PEG(){
        $text = "PEG อันนี้วิธีคิดมาจาก ปีเตอร์ ลินซ์ นักลงทุนชื่อดัง โดยวิธีนี้เหมาะสำหรับธุรกิจที่กำลังเติบโตอย่างมาก หรือ growth stock นั่นเอง โดย ปีเตอร์ ลินซ์ กล่าวว่า PEG < 1 ถือว่าลงทุนได้ ยิ่งน้อยยิ่งดี";

        return view('stock.peg');
    }

    public function DDM(){
        $text = "DDM ผมจะใช้กับธุรกิจธุรกิจที่ดี . มั่นคง รวมถึงจ่ายเงินปันผลสม่ำเสมอและต่อเนื่อง โดยควรเทียบกับผลตอบแทนจากดอกเบี้ยที่มีความแน่นอนและไม่เสี่ยงในปัจจุบัน และ อนาคต";
        return view('stock.ddm');
    }

    public function DCF(){
        $text = "DCF เป็น Model สำหรับการ Valuation ที่ควรศึกษาอย่างยิ่ง เพราะ จะทำให้เราเข้าใจธุรกิจมากขึ้น แต่บางคนจะเอาจริงเอาจังกับวิธีนี้มากๆพอกับ P/E แต่วิธีไม่ใช่จะใช้ได้กับทุกบริษัท โดยควรใช้กับบริษัทที่มีรายได้แน่นอน บางคนบอกว่าควรใช้วิธีไหนดี ระหว่าง DCF กับ P/E ผมว่าขึ้นกับความถนัดของแต่ละคน. โดยจริงๆ P/E รากฐานความคิดก็มาจาก DCF นี่แหละ เท่าที่ผมสังเกตก็มีนักลงทุนรายใหญ่บางคนก็ไม่ใช้ DCF ใช้แต่ P/E";
        return view('stock.dcf');
    }

    public function PS(){
        $text = "P/S เหมาะสำหรับธุรกิจที่ยังขาดทุนอยู่ อาจใช้ร่วมกับ วิธี Market cap ก็ได้";
        return view('stock.ps');
    }

    public function EV(){
        $text = "EV/ Ebitda โดย EV หรือ Enterprise Value คือมูลค่าสุทธิของกิจการ = Market Cap + Net Debt - Cash (มูลค่าตลาด + หนี้สินรวม - เงินสดรวม) พูดง่ายคือ มูลค่าทั้งหมดของหุ้นตัวนั้น นั่นเอง เมื่อ EV ถูกหารด้วย Ebitda มันจะคล้ายๆจะความหมายคล้ายๆกับ P/E ที่มีค่าน้อยยิ่งดี เอาไว้ใช้วัดความถูกแพง ว่าหุ้นตัวนั้นน่าลงทุนหรือไม่ โดยมองว่า EV ก็เหมือน market price ส่วน Ebitda ก็คล้าย eps โดยวิธีนี้เหมาะกับบริษัทที่มี Fixed Cost สูง ";
        return view('stock.ev');
    }
}
